In [1]:
import pandas as pd
from collections import Counter

In [3]:
news_domains_df = pd.read_csv("../data/output/news_domains.csv")

In [52]:
new_news_domains_df = pd.read_csv("../data/output/news_domains.csv")

In [53]:
def n_dots(domain):
    return Counter(domain)['.']

In [12]:
news_domains_df['n_dots'] = news_domains_df.domain.apply(n_dots)

In [54]:
new_news_domains_df['n_dots'] = new_news_domains_df.domain.apply(n_dots)

In [55]:
news_domains_df.n_dots.value_counts()

n_dots
1    19895
2     1460
3      108
0       19
4        6
5        1
Name: count, dtype: int64

In [56]:
new_news_domains_df.n_dots.value_counts()

n_dots
1    19895
2     1460
3      108
4        6
5        1
Name: count, dtype: int64

In [59]:
new_news_domains_df.query("n_dots == 4")

                                     domain  n_dots
10338  personaldefenseworld.com.via.snip.ly       4
16398                   www.ctn.state.ct.us       4
16756               www.dobbins.afrc.af.mil       4
18267            www.youngstown.afrc.af.mil       4
18502              www.apgnews.apg.army.mil       4
18644              www.westover.afrc.af.mil       4

In [49]:
fisher_cleaned = pd.read_csv("../data/intermediate_files/fisher_cleaned.csv")

In [40]:
fisher_cleaned[~fisher_cleaned.domain.str.contains("/.")]

                   domain dataset
0             1011now.com  fisher
1              10news.com  fisher
2                10tv.com  fisher
3             11alive.com  fisher
4              12news.com  fisher
...                   ...     ...
7214        zerkalomn.com  fisher
7215  zion-bentonnews.com  fisher
7216       zioncanyon.com  fisher
7217            zip06.com  fisher
7218         zumbrota.com  fisher

[7219 rows x 2 columns]

In [50]:
temp_df = fisher_cleaned.query("domain == 'alaska broadcast television'").copy()

In [51]:
temp_df

Empty DataFrame
Columns: [domain, dataset]
Index: []

In [48]:
temp_df.domain.str.contains("\\.")

147    False
Name: domain, dtype: bool

In [3]:
new_suffix_based_list = pd.read_csv("../data/intermediate_files/suffix_based_domain_list.csv")

In [7]:
old_suffix_based_list = pd.read_csv("../data/raw_data/suffix_based_domains_to_exclude.csv")
old_suffix_based_list = old_suffix_based_list.dropna(subset="domain")

In [5]:
new_suffix_based_list

                      domain suffix
0                   nasa.gov    gov
1              brookings.edu    edu
2    pubmed.ncbi.nlm.nih.gov    gov
3           ncbi.nlm.nih.gov    gov
4                    nih.gov    gov
..                       ...    ...
283                  lls.edu    edu
284           pepperdine.edu    edu
285                  apu.edu    edu
286            chalcedon.edu    edu
287                 bard.edu    edu

[288 rows x 2 columns]

In [12]:
a = set(new_suffix_based_list.domain)
b = set(old_suffix_based_list.domain)

In [10]:
len(a)

288

In [13]:
len(b)

287

In [17]:
a - (a & b)

{'bard.edu'}

In [8]:
old_suffix_based_list

                         domain suffix  exclude
0                 brookings.edu    edu     True
1                      chop.edu    edu     True
2            health.harvard.edu    edu    False
3                  columbia.edu    edu     True
4                      yale.edu    edu     True
..                          ...    ...      ...
333           www.robins.af.mil    mil     True
334        www.stewart.army.mil    mil     True
335            www.usafa.af.mil    mil     True
336    www.westover.afrc.af.mil    mil     True
337  www.youngstown.afrc.af.mil    mil     True

[338 rows x 3 columns]